#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

//转义字符  （转变字符原有意思）

//int main()
//{
//	//printf("(are you ok ??)");  //原c三字母词 ??)-- ]
//	
//	//// \' 表示字符常量
//	//printf("%c\n", '\''); //可打印出’
//	//printf("%s\n", "abc");
//	//printf("%s\n", "a");
//	//printf("%s\n", "\"");  //打印出”  //" ' "这样不会冲突因为不会组成一对
//
//	//// \ddd (ddd表示1-3个八进制数字
//	//// \xdd (dd表示2个十六进制数字
//
//	//printf("%c\n", '\130');  //八进制的1 3 0  //ASCll 转换为X（= 88）
//	//printf("%d\n", '\101');  // A - 65 -- 转八进制 = 101
//	//printf("%c\n", '\x30');  // 十六进制的48 -- ASCll = 0
//
//	//printf("%d\n", strlen("c:\test\328\test.c"));  //长度为14 ，其中八进制数中不含有8，所以\32除却了8转义为同一字符，\t为同一字符
//
//	return 0;
//}

 //注释:用于解释复杂代码
//int main()
//{
//	//int a = 10 //C++注释风格
//	/*
//	C语言的注释风格，不支持嵌套注释  //即当遇到第一个（）后后续（）就不可用了
//	*/
//	
//	return 0;
//}

////选择语句
//
//int main()
//{
//	int input = 0; //输入值
//	printf("好好学习!\n");
//	printf("要好好学习吗(0/1)?:");
//	scanf("%d", &input);
//	if (input == 1)
//	{
//		printf("不错!为共产主义事业奋斗终生！\n");
//	}
//	else
//	{
//		printf("拧螺丝\n");
//	}
//
//	return 0;
//}

////循环语句
//
//int main()
//{
//	int line = 0;
//	while (line < 30000)
//	{
//		printf("写代码:%d\n", line);
//		line++;
//	}
//	if (line == 30000);
//	{
//		printf("你成功了！");
//	}
//
//	return 0;
//}

//操作符
//移位操作符  <<左移 >>右移
//移的是二进制位

int main()
{
	int a = 2;  //整形是4byte=32bit，a转为二进制 = 10   最终表示为：00000000000000000000000000000010
	int b = a << 1;   //向左移一位，减少开头的一个0，则在末尾补上0，满足32位，前全为0后四位表示为0100，
	printf("%d\n", b);  // 转回十进制 b = 4

	return 0;
}